app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.page(params[:page]).per(10)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "is_admin" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["is_admin", true], ["updated_at", Thu, 02 Apr 2015 01:46:57 UTC +00:00]]
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(user_params)