app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index

    if params[:search]
      @movies = Movie.search(params[:search]).order("created_at DESC")
    else
      @movies = Movie.all

INSERT INTO "movies" ("created_at", "description", "director", "image", "poster_image_url", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "12"]]
---
  def update
    @movie = Movie.find(params[:id])